Z_h_PV/testcases/laminarFlamelet/B-ResultsSmalldt/0/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.2738946145e+03; 

boundaryField
{
    closed
    {
        //type            zeroGradient;
        type            lookUpEnthalpy;
        h0              $internalField;
        value           $internalField;
        //type            calculated;
        //value           $internalField;
    }
    open
    {
        type            zeroGradient;
        //type            calculated;
        //value           $internalField;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
